Question 3

Import your analysis libraries, as well as your new customer data set as a dataframe.

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
#Importing data set customers.csv
df_customers = pd.read_csv(r'C:\Users\Sarah\Desktop\Data Course\08-12-2022 Instacart Basket Analysis\02 Data\Original Data\customers.csv', index_col = False)

In [3]:
#checking shape
df_customers.shape

(206209, 10)

In [4]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

Question 4

Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [5]:
#correcting spelling
df_customers.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'surname', 'STATE' : 'state', 'Age' : 'age', 'Gender' : 'gender','fam_status' : 'marital_status'}, inplace = True)

In [6]:
df_customers.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

Question 5

Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

Null Data

In [7]:
#checking for missing data
df_customers.isnull().sum()

user_id               0
first_name        11259
surname               0
gender                0
state                 0
age                   0
date_joined           0
n_dependants          0
marital_status        0
income                0
dtype: int64

In [9]:
#seperating no data
df_nan = df_customers[df_customers['first_name'].isnull() == True]

In [10]:
df_nan

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [12]:
#replace values in first name column when customer is male
df_nan.loc[df_nan['gender'] == 'Male', 'first_name'] = 'Mr.'

In [13]:
#replace values in first name column when customer is female
df_nan.loc[df_nan['gender'] == 'Female', 'first_name'] = 'Ms.'

In [14]:
df_nan.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
53,76659,Mr.,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,Ms.,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,Ms.,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,Mr.,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,Ms.,Dawson,Female,Utah,63,1/1/2017,3,married,151819

Duplicates

In [42]:
#checking for duplicates
df_dups = df_customers[df_customers.duplicated()]

In [44]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

No duplicates.

In [47]:
#checking for mixed types
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

first_name

The mixed types must be the mix between NaNs and names.

In [98]:
# Convert first_name data type to string
df_customers['first_name'] = df_customers['first_name'].astype('str')

In [99]:
#checking for mixed types
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

Question 6

Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [100]:
#Importing data set orders_products_combinedNEW.pkl
df_ords_prods_merged = pd.read_pickle(os.path.join(r'C:\Users\Sarah\Desktop\Data Course\08-12-2022 Instacart Basket Analysis\02 Data\Prepared Data\orders_products_combinedNEWUPDATED.pkl'))

In [101]:
df_ords_prods_merged.shape

(32404859, 24)

In [105]:
#correcting data
df_ords_prods_merged['user_id'] = df_ords_prods_merged['user_id'].astype('str')

In [108]:
df_ords_prods_merged.dtypes

order_id                     int64
user_id                     object
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
_merge                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
Most_orders                 object
max_order                    int64
loyalty_flag                object
average_price              float64
spending_flag               object
frequency_order            float64
order_frequency_flag        object
dtype: object

In [111]:
df_customers.dtypes

user_id            int64
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [112]:
df_customers['user_id'] = df_customers['user_id'].astype('str')

In [113]:
df_customers.dtypes

user_id           object
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [114]:
#merging
df_ords_prods_custs_merged = df_ords_prods_merged.merge(df_customers, on = 'user_id')

In [115]:
#checking shape
df_ords_prods_custs_merged.shape

(32404859, 33)

In [116]:
df_ords_prods_custs_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,order_frequency_flag,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,2539329,1,1,2,8,0.0,196,1,0,Soda,...,Regular customer order,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Regular customer order,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Regular customer order,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Regular customer order,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Regular customer order,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

Question 8

Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [117]:
# Export data to pkl

df_ords_prods_custs_merged.to_pickle(os.path.join(r'C:\Users\Sarah\Desktop\Data Course\08-12-2022 Instacart Basket Analysis\02 Data\Prepared Data\customers_orders_products_combined.pkl'))